Documents/бит_СметаДоходовИРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СметаДоходовИРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ОборотыПоСметам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПланирования</Name>
					<Comment>Начало интервала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПланирования</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДерева</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БДДС</Name>
					<Comment>БДДС</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗданиеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>Комментарий</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределения</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Comment>Статья оборотов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗданиеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ЗначениеСвойствОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначениеСвойствОбъектовУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_СвойстваОбъектовУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_СметаДоходовИРасходов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Функция восстанавливает период по имени колонки
//
// Параметры:
//  ИмяКолонки  – Строка.
//
// Возвращаемое значение:
//   РезПериод   – Дата.
//
Функция ПолучитьПериодПоИмениКолонки(ИмяКолонки) 
	
	РезПериод = Дата('00010101');
	
	НомерПодчеркивания = Найти(ИмяКолонки,"_");
	Если НомерПодчеркивания >0 Тогда
		
		ПериодСтр = Сред(ИмяКолонки,НомерПодчеркивания+1);
		Попытка
			
			РезПериод = Дата(ПериодСтр);
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат РезПериод;
	
КонецФункции

&НаКлиенте
// Процедура выполняет заполнение ячейку таблицы ДанныеДерева по отборам таблицы БДДС
// и вызвает последующий перерасчет итогов.
//
// Параметры:
//  Отбор  – Структура.
//
Процедура ЗаполнитьЗначениеЯчейкиДерева(Отбор)
	
	Итог = ВычислитьИтогСОтбором("БДДС", Отбор, "Сумма");
	
	СтрокаДерева = Элементы.ДанныеДерева.ТекущиеДанные;
	
	ИмяКолонки = "РеквизитДерева_" + Формат(Отбор.Период,"ДФ=yyyyMMdd");
	
	СтрокаДерева[ИмяКолонки] = Итог;
	
	ВыполнитьПересчетВСтрокеДерева(СтрокаДерева);
	
	ВычислитьИтогПоВерхнимУровням(СтрокаДерева, ИмяКолонки);
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняет расчет итоговых значений в строке дерева данных
//
// Параметры:
//  СтрокаДерева  – СтрокаДереваЗначений.
//
Процедура ВыполнитьПересчетВСтрокеДерева(СтрокаДерева)
	
	Если СтрокаДерева = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Итог = 0;
	
	Для каждого Колонка Из мКолонкиДерева Цикл
		
		Итог = Итог +  СтрокаДерева[Колонка.Ключ];
		
	КонецЦикла; 
	
	СтрокаДерева.Итого = Итог;
	
КонецПроцедуры

&НаКлиенте
// Вычисляет сумму по верхним (по отношению к стартовой) строкам деревам значения
//             для указанной колонки
// Параметры:
//  СтартоваяСтрока  – СтрокаДереваЗначений,
//  ИмяКолонки       – Строка.
//
Процедура ВычислитьИтогПоВерхнимУровням(СтартоваяСтрока,ИмяКолонки)
	
	Если СтартоваяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СтрокаРодитель = СтартоваяСтрока.ПолучитьРодителя();
	
	Если СтрокаРодитель <> Неопределено Тогда
		
		Итог     = 0;
		
		ЭлементыРодителя =  СтрокаРодитель.ПолучитьЭлементы ();
		
		Для каждого СтрокаДерева Из ЭлементыРодителя Цикл
			
			Итог = Итог + СтрокаДерева[ИмяКолонки];
			
		КонецЦикла; 
		
		Если СтрокаРодитель.ЭтоГруппа Тогда
			
			СтрокаРодитель[ИмяКолонки]     = Итог;
			
			ВыполнитьПересчетВСтрокеДерева(СтрокаРодитель);
			
		КонецЕсли; 
		
		ВычислитьИтогПоВерхнимУровням(СтрокаРодитель,ИмяКолонки);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Вычисляет итог  по строкам табличной части, удовлетворяющим отбору
//
// Параметры:
//  ТабЧасть  – ИмяТабличнойЧасти,
//  Отбор     - Структура,
//  ИмяРесурса- Строка. 
//
// Возвращаемое значение:
//   Итог   – Число.
//
Функция ВычислитьИтогСОтбором(ТабЧасть,Отбор,ИмяРесурса)
	
	Итог = 0; 
	МассивСтрок = Объект[ТабЧасть].НайтиСтроки(Отбор);
	
	Для каждого СтрокаТЧ Из МассивСтрок Цикл
		
		Итог = Итог+СтрокаТЧ[ИмяРесурса];
		
	КонецЦикла; 
	
	Возврат Итог;
	
КонецФункции

&НаКлиенте
// Разбивает сумму бюджета по зданиям
//
// Параметры:
//  ТабЧасть  – ИмяТабличнойЧасти,
//  Отбор     - Структура,
//  СуммаИтог - Число. 
//
Процедура РазбитьСуммуПоЗданиям(Отбор, СуммаИтог)
	
	МассивСтрок = Объект.БДДС.НайтиСтроки(Отбор);
	
	Количество = МассивСтрок.Количество();
	
	ПроцентИтог   = 0;
	СуммаКонтроль = 0;
	
	Для каждого СтрокаТЧ Из МассивСтрок Цикл
		
		Сумма   = 0;
		
		Сумма = Окр((СуммаИтог * СтрокаТЧ.Процент)/100, 2);
		СтрокаТЧ.Сумма   = Сумма;
		
		СуммаКонтроль   = СуммаКонтроль   + Сумма;
		
		ПроцентИтог = ПроцентИтог + СтрокаТЧ.Процент;
		
	КонецЦикла;
	
	Если Количество > 0 Тогда
		
		РазницаСумма   = СуммаИтог   - СуммаКонтроль;
		
		Если РазницаСумма <> 0 Тогда
			
			СтрокаТЧ.Сумма   =  СтрокаТЧ.Сумма + РазницаСумма;
			
		КонецЕсли;
		
		РазницаПпроцент = 100  - ПроцентИтог;
		
		Если РазницаПпроцент <> 0 Тогда
			
			СтрокаТЧ.Процент   =  СтрокаТЧ.Процент + РазницаПпроцент;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Настройки.Видимость = НЕ Объект.СкрыватьНастройки;
	
	Элементы.Дата.ТолькоПросмотр						= Объект.Проведен;
	Элементы.Номер.ТолькоПросмотр						= Объект.Проведен;
	Элементы.БДДС.ТолькоПросмотр						= Объект.Проведен;   
	Элементы.СписокЗданий.ТолькоПросмотр				= Объект.Проведен;
	Элементы.ДанныеДерева.ТолькоПросмотр				= Объект.Проведен;
	Элементы.Ответственный.ТолькоПросмотр				= Объект.Проведен;
	Элементы.Комментарий.ТолькоПросмотр					= Объект.Проведен;
	Элементы.Организация.ТолькоПросмотр					= Объект.Проведен;
	Элементы.Сценарий.ТолькоПросмотр					= Объект.Проведен;
	Элементы.ДатаНачалаПланирования.ТолькоПросмотр		= Объект.Проведен;
	Элементы.ДатаОкончанияПланирования.ТолькоПросмотр	= Объект.Проведен;
	Элементы.НастройкаПериода.Доступность				=  НЕ Объект.Проведен;
	Элементы.ДанныеДереваЗаполнить.Доступность			=  НЕ Объект.Проведен;
	Элементы.СпособРаспределения.ТолькоПросмотр			= Объект.Проведен;
	Элементы.СпособРаспределенияБДДС.ТолькоПросмотр		= Объект.Проведен;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		ИнициализироватьКолонки();
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		Дерево = ДокументОбъект.ХранилищеДерева.Получить();
		
		Если НЕ Дерево = Неопределено Тогда
			
			ЗаполнитьДеревоОбходом(Дерево);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Дерево = РеквизитФормыВЗначение("ДанныеДерева");
	
	Если НЕ Дерево.Строки.Количество() = 0 Тогда
		
		ТекущийОбъект.ХранилищеДерева = Новый ХранилищеЗначения(Дерево);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если ИнтерфейсТакси Тогда
		
		Элементы.ДанныеДерева.Высота = 10;
		Элементы.ДанныеДерева.РастягиватьПоВертикали = Ложь; 
		
		Элементы.БДДС.Высота = 10;
		Элементы.БДДС.РастягиватьПоВертикали = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

// Процедура - обработчик события "Нажатие" кнопки "НастройкаПериода".
//
&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала    = Объект.ДатаНачалаПланирования;
	Период.ДатаОкончания = Объект.ДатаОкончанияПланирования;
	
	ДиалогРедактированияПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактированияПериода.Период = Период;
	
	ДиалогРедактированияПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение1", ЭтотОбъект, Новый Структура("ДиалогРедактированияПериода", ДиалогРедактированияПериода))); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение1(Период1, ДополнительныеПараметры) Экспорт
	
	ДиалогРедактированияПериода = ДополнительныеПараметры.ДиалогРедактированияПериода;
	
	Если ЗначениеЗаполнено(Период1) Тогда
		
		мДатаНачала    = ДиалогРедактированияПериода.Период.ДатаНачала;
		мДатаОкончания = ДиалогРедактированияПериода.Период.ДатаОкончания;
		
		Если ДанныеДерева.ПолучитьЭлементы().Количество() > 0 Тогда
			
			Ответ = Неопределено;
			
			ПоказатьВопрос(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект, Новый Структура("мДатаНачала", мДатаНачала)), "Данные будут очищенны, продолжить?", РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
			Возврат;
			
		КонецЕсли;
		
		НастройкаПериодаФрагмент(мДатаНачала, мДатаОкончания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	мДатаНачала = ДополнительныеПараметры.мДатаНачала;
	
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьДерво();
	Иначе
		
		мДатаНачала    = Объект.ДатаНачалаПланирования;
		мДатаОкончания = Объект.ДатаОкончанияПланирования;
		
	КонецЕсли;
	
	НастройкаПериодаФрагмент(мДатаНачала, мДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаФрагмент(Знач мДатаНачала, Знач мДатаОкончания)
	
	Объект.ДатаНачалаПланирования    = мДатаНачала;
	Объект.ДатаОкончанияПланирования = мДатаОкончания;
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Заполнить".
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Обновить = Истина;
	
	Если ДанныеДерева.ПолучитьЭлементы().Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Данные будут очищенны, продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьФрагмент(Обновить);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Обновить = Ложь;
	Иначе
		Обновить = Истина;
	КонецЕсли;
	
	ЗаполнитьФрагмент(Обновить);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФрагмент(Знач Обновить)
	
	Если Обновить Тогда
		
		ОбновитьДерво();
		
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "Скрыть".
//
&НаКлиенте
Процедура Скрыть(Команда)
	
	Объект.СкрыватьНастройки = НЕ Объект.СкрыватьНастройки;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура СпособРаспределенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.Форма.ФормаВыбора", Новый Структура("ТолькоЧисло", Истина), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияПриИзменении(Элемент)
	
	ЗаполнитьПроцентыСписокЗданий();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияБДДСПриИзменении(Элемент)
	
	ТекущиеДанныеДрева   = Элементы.ДанныеДерева.ТекущиеДанные;
	ТекущаяЭлементДерева = Элементы.ДанныеДерева.ТекущийЭлемент;
	
	Если ТекущаяЭлементДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанныеДрева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = ТекущаяЭлементДерева.Имя;
	
	Если Найти(ИмяКолонки,"РеквизитДерева_") > 0 Тогда
		СуммаРаспределения = ТекущиеДанныеДрева[ИмяКолонки];
		ЗаполнитьПроцентБДДС(СуммаРаспределения);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияБДДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.Форма.ФормаВыбора", Новый Структура("ТолькоЧисло", Истина), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляДанныеДерева

// Процедура - обработчик события "ПриАктивизацииЯчейки" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваПриАктивизацииЯчейки(Элемент)
	
	СпособРаспределения = Неопределено;
	
	ТекущиеДанныеДрева   = Элемент.ТекущиеДанные;
	ТекущаяЭлементДерева = Элемент.ТекущийЭлемент;
	
	Если ТекущаяЭлементДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанныеДрева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = ТекущаяЭлементДерева.Имя;
	Если Найти(ИмяКолонки,"РеквизитДерева_") > 0 Тогда
		
		ТекущийПериод = ПолучитьПериодПоИмениКолонки(ИмяКолонки);
		Если Не ЗначениеЗаполнено(ТекущийПериод) Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		СтруктураПараметров = Новый Структура("Период, СтатьяОборотов, ИД");
		СтруктураПараметров.Период         = ТекущийПериод;
		СтруктураПараметров.СтатьяОборотов = ТекущиеДанныеДрева.СтатьяОборотов;
		СтруктураПараметров.ИД             = ТекущиеДанныеДрева.Идентификатор;
		
		Элементы.БДДС.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПараметров);
		
		ТекущиеДанные = Объект.БДДС.НайтиСтроки(СтруктураПараметров);
		
		Если НЕ ТекущиеДанные = неопределено И ТекущиеДанные.Количество() > 0 Тогда
			
			СпособРаспределения = ТекущиеДанные[0].СпособРаспределения;
			
		КонецЕсли;
		
	Иначе
		
		СтруктураПараметров = Новый Структура("СтатьяОборотов");
		СтруктураПараметров.СтатьяОборотов = Неопределено;
		
		Элементы.БДДС.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПараметров);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "НачалоПеретаскивания" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	мПараметрыПеретаскивания = Неопределено;
	
	мСписокСтрок             =  Неопределено;
	ТекущиеДанныеДрева   = Элемент.ТекущиеДанные;
	ТекущаяЭлементДерева = Элемент.ТекущийЭлемент;
	
	Если ТекущаяЭлементДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанныеДрева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = ТекущаяЭлементДерева.Имя;
	Если Найти(ИмяКолонки,"РеквизитДерева_") > 0 Тогда
		
		ТекущийПериод = ПолучитьПериодПоИмениКолонки(ИмяКолонки);
		Если Не ЗначениеЗаполнено(ТекущийПериод) Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		Отбор = Новый Структура("Период,СтатьяОборотов,ИД");
		Отбор.Период         = ТекущийПериод;
		Отбор.СтатьяОборотов = ТекущиеДанныеДрева.СтатьяОборотов;
		Отбор.ИД             = ТекущиеДанныеДрева.Идентификатор;
		
		МассивСтрок = Объект.БДДС.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество()> 0 Тогда
			
			мПараметрыПеретаскивания = Новый Структура;
			мПараметрыПеретаскивания.Вставить("МассивСтрок",МассивСтрок);
			мПараметрыПеретаскивания.Вставить("ИмяКолонки",ИмяКолонки);
			мПараметрыПеретаскивания.Вставить("ПрефиксКолонки",Лев(ИмяКолонки,15));
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПроверкаПеретаскивания" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если Поле = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СтрокаДерева = ДанныеДерева.НайтиПоИдентификатору(Строка);
	
	Если СтрокаДерева = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если СтрокаДерева.ЭтоГруппа Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если мПараметрыПеретаскивания <> Неопределено Тогда
		
		ИмяКолонки = Поле.Имя;
		ПрефиксКолонки = Лев(ИмяКолонки,15);
		
		Если СтрокаДерева[ИмяКолонки] <> 0 Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		ТекущийПериод = ПолучитьПериодПоИмениКолонки(ИмяКолонки);
		Если Не ЗначениеЗаполнено(ТекущийПериод) Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		Если ПрефиксКолонки = мПараметрыПеретаскивания.ПрефиксКолонки Тогда
			
			Итог = 0;
			
			Для каждого СтрокаИсточник Из мПараметрыПеретаскивания.МассивСтрок Цикл
				
				НоваяСтрока = Объект.БДДС.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаИсточник);
				НоваяСтрока.СтатьяОборотов      = СтрокаДерева.СтатьяОборотов;
				НоваяСтрока.Период              = ТекущийПериод;
				НоваяСтрока.ИД                  = СтрокаДерева.Идентификатор;
				НоваяСтрока.СпособРаспределения = СпособРаспределения;
				
				Итог = Итог + НоваяСтрока.Сумма;
				
			КонецЦикла; 
			
			СтрокаДерева[ИмяКолонки] = Итог;
			
			ВыполнитьПересчетВСтрокеДерева(СтрокаДерева);
			
			ВычислитьИтогПоВерхнимУровням(СтрокаДерева, ИмяКолонки);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеПеретаскивания" табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если мПараметрыПеретаскивания <> Неопределено Тогда
		
		мПараметрыПеретаскивания = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - назначаемый обработчик события "ПриИзменении", 
// созданным автоматически полям табличного поля "ДанныеДерева".
//
&НаКлиенте
Процедура ДанныеДереваПериодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеДерева.ТекущиеДанные;
	
	Отбор = Новый Структура;
	
	ТекущиеДанныеБДДС = Элементы.БДДС.ТекущиеДанные;
	
	Отбор.Вставить("СтатьяОборотов", Элементы.БДДС.ОтборСтрок.СтатьяОборотов);
	Отбор.Вставить("Период"        , Элементы.БДДС.ОтборСтрок.Период);
	Отбор.Вставить("ИД"            , Элементы.БДДС.ОтборСтрок.ИД);
	
	СуммаИтог = ТекущиеДанные[Элемент.Имя];
	
	МассивСтрок = Объект.БДДС.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() = 0 Тогда
		
		Для каждого Строка Из Объект.СписокЗданий Цикл
			
			НоваяСтрока = Объект.БДДС.Добавить();
			НоваяСтрока.СтатьяОборотов = Элементы.БДДС.ОтборСтрок.СтатьяОборотов;
			НоваяСтрока.Здание         = Строка.Здание;
			НоваяСтрока.Процент        = Строка.Процент;
			НоваяСтрока.Период         = Элементы.БДДС.ОтборСтрок.Период;
			НоваяСтрока.ИД             = Элементы.БДДС.ОтборСтрок.ИД;
			
			ПочтовыйАдрес = ПочтовыйАдресНаСервере(Строка.Здание);
			
			НоваяСтрока.Адрес          = ПочтовыйАдрес;
			НоваяСтрока.СпособРаспределения = Объект.СпособРаспределения;
			
			Улица = УлицаНаСервере(Строка.Здание);
			
			НоваяСтрока.ЗданиеПредставление = "ул." + Улица + " ,д" + Строка.Здание;;
			
		КонецЦикла;
		
		СпособРаспределения = Объект.СпособРаспределения;
		
	КонецЕсли;
	
	РазбитьСуммуПоЗданиям(Отбор, СуммаИтог);
	
	Элементы.БДДС.Обновить();
	
	ВыполнитьПересчетВСтрокеДерева(ТекущиеДанные);
	ВычислитьИтогПоВерхнимУровням(ТекущиеДанные,Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляБДДС

// Процедура - обработчик события "ПередНачаломДобавления" табличного поля "БДДС".
//
&НаКлиенте
Процедура БДДСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущиеДанныеДерева = Элементы.ДанныеДерева.ТекущиеДанные;
	
	Если ТекущиеДанныеДерева = Неопределено 
		ИЛИ ТекущиеДанныеДерева.ЭтоГруппа Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекОтборСтрок = Элементы.БДДС.ОтборСтрок;
	
	Если ТекОтборСтрок = Неопределено ИЛИ Не ТекОтборСтрок.Свойство("ИД") ИЛИ Не ТекОтборСтрок.Свойство("Период")Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Невозможно добавить данные: не установлены отборы в таблице.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением" табличного поля "БДДС".
//
&НаКлиенте
Процедура БДДСПередУдалением(Элемент, Отказ)
	
	ТекОтборСтрок = Элементы.БДДС.ОтборСтрок;
	
	Если ТекОтборСтрок = Неопределено ИЛИ Не ТекОтборСтрок.Свойство("ИД") ИЛИ Не ТекОтборСтрок.Свойство("Период")Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Невозможно добавить данные: не установлены отборы в таблице.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПослеУдаления" табличного поля "БДДС".
// 
&НаКлиенте
Процедура БДДСПослеУдаления(Элемент)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("СтатьяОборотов", Элементы.БДДС.ОтборСтрок.СтатьяОборотов);
	Отбор.Вставить("Период"        , Элементы.БДДС.ОтборСтрок.Период);
	Отбор.Вставить("ИД"            , Элементы.БДДС.ОтборСтрок.ИД);
	
	ЗаполнитьЗначениеЯчейкиДерева(Отбор);
	
	ТекущиеДанныеДрева   = Элементы.ДанныеДерева.ТекущиеДанные;
	ТекущаяЭлементДерева = Элементы.ДанныеДерева.ТекущийЭлемент;
	
	Если ТекущаяЭлементДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанныеДрева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = ТекущаяЭлементДерева.Имя;
	
	Если Найти(ИмяКолонки,"РеквизитДерева_") > 0 И ЗначениеЗаполнено(СпособРаспределения)Тогда
		СуммаРаспределения = ТекущиеДанныеДрева[ИмяКолонки];
		ЗаполнитьПроцентБДДС(СуммаРаспределения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриНачалеРедактирования" табличного поля "БДДС".
//
&НаКлиенте
Процедура БДДСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекОтборСтрок = Элементы.БДДС.ОтборСтрок;
	
	Если Не Копирование Тогда
		
		Если ТекОтборСтрок.Свойство("СтатьяОборотов") Тогда
			ТекущиеДанные.СтатьяОборотов = ТекОтборСтрок.СтатьяОборотов;
		КонецЕсли;
		Если ТекОтборСтрок.Свойство("Период") Тогда
			ТекущиеДанные.Период = ТекОтборСтрок.Период;
		КонецЕсли;
		Если ТекОтборСтрок.Свойство("ИД") Тогда
			ТекущиеДанные.ИД = ТекОтборСтрок.ИД;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "Процент" табличного поля "БДДС".
//
&НаКлиенте
Процедура БДДСПроцентПриИзменении(Элемент)
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("СтатьяОборотов", Элементы.БДДС.ОтборСтрок.СтатьяОборотов);
	Отбор.Вставить("Период"        , Элементы.БДДС.ОтборСтрок.Период);
	Отбор.Вставить("ИД"            , Элементы.БДДС.ОтборСтрок.ИД);
	
	ПроцентИтог = ВычислитьИтогСОтбором("БДДС", Отбор, "Процент");
	
	ИмяКолонки = "РеквизитДерева_" + Формат(Отбор.Период,"ДФ=yyyyMMdd");
	
	СуммаКонтроль = Элементы.ДанныеДерева.ТекущиеДанные[ИмяКолонки];
	
	ТекстПодвала = "";
	
	Если ПроцентИтог > 100 Тогда
		
		Процент = ПроцентИтог - 100;
		
		ТекстПодвала  = "Превышен на : " + Процент
		
	Иначе
		
		РазбитьСуммуПоЗданиям(Отбор, СуммаКонтроль);
		
	КонецЕсли;
	
	Элементы.БДДСПроцент.ТекстПодвала = ТекстПодвала;
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "Здание" табличного поля "БДДС".
//
&НаКлиенте
Процедура БДДСЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "Здание" табличного поля "БДДС".
//
&НаКлиенте
Процедура БДДСЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.БДДС.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СтатьяОборотов", Элементы.БДДС.ОтборСтрок.СтатьяОборотов);
	Отбор.Вставить("Период"        , Элементы.БДДС.ОтборСтрок.Период);
	Отбор.Вставить("ИД"            , Элементы.БДДС.ОтборСтрок.ИД);
	Отбор.Вставить("Здание"        , ВыбранноеЗначение);
	
	МассивСтрок = Объект.БДДС.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() = 0 Тогда
		
		ТекущиеДанные.Адрес               = ВыбранноеЗначение.ПочтовыйАдрес;
		ТекущиеДанные.Здание              = ВыбранноеЗначение;
		ТекущиеДанные.ЗданиеПредставление = "ул." + ВыбранноеЗначение.Улица + " ,д" + ВыбранноеЗначение;
		
		ТекущиеДанныеДрева   = Элементы.ДанныеДерева.ТекущиеДанные;
		ТекущаяЭлементДерева = Элементы.ДанныеДерева.ТекущийЭлемент;
		
		Если ТекущаяЭлементДерева = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанныеДрева = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяКолонки = ТекущаяЭлементДерева.Имя;
		
		Если Найти(ИмяКолонки,"РеквизитДерева_") > 0 Тогда
			СуммаРаспределения = ТекущиеДанныеДрева[ИмяКолонки];
			ЗаполнитьПроцентБДДС(СуммаРаспределения);
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Здание уже выбрано.";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСЗданиеПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСписокЗданий

// Процедура - обработчик события "НачалоВыбора" поля ввода "Здание" табличного поля "СписокЗданий".
//
&НаКлиенте
Процедура СписокЗданийЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаВыбора" поля ввода "Здание" табличного поля "СписокЗданий".
//
&НаКлиенте
Процедура СписокЗданийЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокЗданий.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Здание"        , ВыбранноеЗначение);
	
	МассивСтрок = Объект.СписокЗданий.НайтиСтроки(Отбор);
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Здание уже выбрано.";
		Сообщение.Сообщить();
		
	Иначе 
		
		ПочтовыйАдрес = ПочтовыйАдресНаСервере(ВыбранноеЗначение);
		Улица = УлицаНаСервере(ВыбранноеЗначение);
		
		ТекущиеДанные.Адрес               = ПочтовыйАдрес;
		ТекущиеДанные.Здание              = ВыбранноеЗначение;
		ТекущиеДанные.ЗданиеПредставление = "ул." + Улица + " ,д" + ВыбранноеЗначение;
		
		Если ЗначениеЗаполнено(Объект.СпособРаспределения) Тогда
			ЗаполнитьПроцентыСписокЗданий();
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПочтовыйАдресНаСервере(ВыбранноеЗначение)
	
	Возврат ВыбранноеЗначение.ПочтовыйАдрес;
	
КонецФункции

&НаСервере
Функция УлицаНаСервере(ВыбранноеЗначение)
	
	Возврат ВыбранноеЗначение.Улица;
	
КонецФункции

// Процедура - обработчик события "ПриИзменении" поля ввода "Процент" табличного поля "СписокЗданий".
//
&НаКлиенте
Процедура СписокЗданийПроцентПриИзменении(Элемент)
	
	ПроцентИтог = Объект.СписокЗданий.Итог("Процент");
	
	ТекстПодвала = "";
	
	Если ПроцентИтог > 100 Тогда
		
		Процент = ПроцентИтог - 100;
		
		ТекстПодвала  = "Превышен на : " + Процент
		
	КонецЕсли;
	
	Элементы.СписокЗданийПроцент.ТекстПодвала = ТекстПодвала;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийЗданиеПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
КонецПроцедуры

&НаСервере
// Функция вычисляет разность дат исходя из заданной периодичности
//
// Параметры:
//  ДатаНачала    – Дата,
//  ДатаОкончания - Дата,
//  Периодичность - Строка.
//
// Возвращаемое значение:
//   Разность   – Число.
//
Функция РазностьДат(ДатаНачала,ДатаОкончания,Периодичность) 
	
	Разность = 0;
	Если ВРег(Периодичность) = "ДЕКАДА" Тогда
		
		// Язык запросов декады не воспринимает в функции разность дат... посчитаем так.
		РазностьМесяцев = РазностьДат(ДатаНачала,ДатаОкончания,"Месяц");
		НомерДекадыНач  = НомерДекады(ДатаНачала);
		НомерДекадыКон  = НомерДекады(ДатаОкончания);		 
		Разность = РазностьМесяцев*3+НомерДекадыКон-НомерДекадыНач;
		
	ИначеЕсли ВРег(Периодичность) = "НЕДЕЛЯ" Тогда
		
		// Язык запросов декады не воспринимает в функции разность дат... посчитаем так.
		РазностьЛет = РазностьДат(ДатаНачала,ДатаОкончания,"Год");
		Разность    = РазностьЛет*53+НеделяГода(ДатаОкончания)-НеделяГода(ДатаНачала);
		
	ИначеЕсли ВРег(Периодичность) = "ПОЛУГОДИЕ" Тогда
		
		// Язык запросов полугодие не воспринимает в функции разность дат... посчитаем так.
		РазностьМесяцев = РазностьДат(ДатаНачала,ДатаОкончания,"Месяц");
		Разность		 = Цел(РазностьМесяцев / 6);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания,"+Периодичность+") КАК Разность";
		
		Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Разность = Выборка.Разность;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Разность;
	
КонецФункции

&НаСервере
// Функция вычисляет номер декады в месяце
//
// Параметры:
//  ТекущаяДата  – Дата.
//
// Возвращаемое значение:
//   НомерДекады   – Число.
//
Функция НомерДекады(ТекущаяДата) 
	
	НомерДня = День(ТекущаяДата);
	Если НомерДня>=1 И НомерДня<=10 Тогда
		НомерДекады = 1;
	ИначеЕсли НомерДня>=11 И НомерДня<=20 Тогда
		НомерДекады = 2;
	Иначе
		НомерДекады = 3;
	КонецЕсли; 
	
	Возврат НомерДекады;
	
КонецФункции

&НаСервере
// Функция получает период по сдвигу исходя из текущего периода и периодичности
//
// Параметры:
//  ДатаНачала  	   – Дата,
//  Сдвиг       	   – Число,
//  Периодичность      - ПеречислениеСсылка.бит_ПериодичностьПланирования,
//  НеприводитьКНачалу - Булево, по умолчанию Ложь.
//
// Возвращаемое значение:
//  ТекущийПериод   – Дата.
//
Функция ПолучитьПериодПоСдвигу(ДатаНачала,Сдвиг,Периодичность,НеприводитьКНачалу = Ложь) 
	
	Если Не НеприводитьКНачалу Тогда
		ТекущийПериод = ПолучитьНачалоПериода(ДатаНачала,Периодичность);
	Иначе
		ТекущийПериод = ДатаНачала;
	КонецЕсли;
	
	Если Сдвиг >= 0 Тогда
		
		Для Значение = 1 По Сдвиг Цикл
			
			КонецПериода  = ПолучитьКонецПериода(ТекущийПериод  ,Периодичность);
			ТекущийПериод = ПолучитьНачалоПериода(КонецПериода+1,Периодичность);
			
		КонецЦикла;
		
	Иначе
		
		КоличествоПериодов = бит_ОбщегоНазначения.МодульЧисла(Сдвиг);
		Для Значение = 1 По КоличествоПериодов Цикл
			
			НачалоПериода = ПолучитьНачалоПериода(ТекущийПериод  ,Периодичность);
			ТекущийПериод = ПолучитьНачалоПериода(ТекущийПериод-1,Периодичность);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат ТекущийПериод;
	
КонецФункции

&НаСервере
// Функция формирует имя колонки 
//
// Параметры:
//  Префикс  – Строка,
//  ТекущийПериод  – Дата.
//
// Возвращаемое значение:
//   Строка.   
//
Функция СформироватьИмяКолонкиПериод(ТекущийПериод)
	
	Возврат Формат(ТекущийПериод,"ДФ=yyyyMMdd");
	
КонецФункции

&НаСервере
// Функция получает начало периода исходя из периодичности
//
// Параметры:
//  ДатаНачала  – Дата,
//  Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования.
//
// Возвращаемое значение:
//  ТекущийПериод   – Дата.
//
Функция ПолучитьНачалоПериода(ДатаНачала,Периодичность) 
	
	ТекущийПериод = ДатаНачала;
	Если ЗначениеЗаполнено(Периодичность) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&ДатаНачала,"+ Периодичность+") КАК ТекущийПериод";
		
		Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ТекущийПериод = Выборка.ТекущийПериод;
			
		КонецЕсли; // по выборке.
	КонецЕсли; // заполнена периодичность.
	
	Возврат ТекущийПериод;
	
КонецФункции

&НаСервере
// Функция получает начало периода исходя из периодичности
//
// Параметры:
//  ДатаНачала  – Дата,
//  Периодичность - ПеречислениеСсылка.бит_ПериодичностьПланирования.
//
// Возвращаемое значение:
//  ТекущийПериод   – Дата.
//
Функция ПолучитьКонецПериода(ДатаНачала,Периодичность) 
	
	ТекущийПериод = ДатаНачала;
	
	Если ЗначениеЗаполнено(Периодичность) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(&ДатаНачала,"+ Периодичность+") КАК ТекущийПериод";
		
		Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ТекущийПериод = Выборка.ТекущийПериод;
			
		КонецЕсли; // по выборке.
	КонецЕсли; // заполнена периодичность.
	
	Возврат ТекущийПериод;
	
КонецФункции

// Процедура выполняет создание колонок в табличном поле ДанныеДерева.
//
&НаСервере
Процедура ИнициализироватьКолонки(ОчиститьРеквизиты = Ложь)
	
	Если ОчиститьРеквизиты Тогда
		
		УдалитьКолонки();
		
	КонецЕсли; 
	
	КоличествоИнтервалов = РазностьДат(Объект.ДатаНачалаПланирования, Объект.ДатаОкончанияПланирования, "Месяц")+1;
	
	// Добавление колонок дерева.
	ДобавляемыеРеквизиты = Новый Массив;
	
	ТипКолонки = ОбщегоНазначения.ОписаниеТипаЧисло(15,2);
	
	Для Значение = 1 По КоличествоИнтервалов Цикл
		
		ТекущийПериод = ПолучитьПериодПоСдвигу(Объект.ДатаНачалаПланирования,Значение - 1,"Месяц");
		
		Если НЕ ЗначениеЗаполнено(ТекущийПериод) Тогда
			Продолжить;
		КонецЕсли; 

		Синоним = Формат(ТекущийПериод,"ДФ='MMMM yyyy'");

		ИмяКолонки = "РеквизитДерева_" + СформироватьИмяКолонкиПериод(ТекущийПериод);
		
		Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
			
			НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, Синоним);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	мКолонкиДерева = Новый Структура;
	
	Для каждого Реквизит Из ДобавляемыеРеквизиты Цикл
		
		ПутьКДанным = "" + Элементы.ДанныеДерева.Имя + "." + Реквизит.Имя;
		
		ЭУ = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), Элементы.ДанныеДерева);
		ЭУ.ПутьКДанным = ПутьКДанным;
		
		ЭУ.Вид            = ВидПоляФормы.ПолеВвода;
		ЭУ.Видимость      = Истина;
		ЭУ.ЦветФона       = WebЦвета.Роса;
		ЭУ.Ширина         = 10;
		ЭУ.ШрифтЗаголовка = Новый Шрифт("MS Shell Dlg", 8, Истина);
		
		мКолонкиДерева.Вставить(ЭУ.Имя);
		
		ЭУ.УстановитьДействие("ПриИзменении", "ДанныеДереваПериодПриИзменении");
		
	КонецЦикла; 
	
	// Доабавление итоговой колонки.
	ДобавляемыеРеквизиты.Очистить();
	
	ИмяКолонки = "Итого";
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, ТипКолонки, Элементы.ДанныеДерева.Имя, ИмяКолонки);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЕсли;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого Реквизит Из ДобавляемыеРеквизиты Цикл
		
		ПутьКДанным = "" + Элементы.ДанныеДерева.Имя + "." + Реквизит.Имя;
		
		ЭУ = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), Элементы.ДанныеДерева);
		ЭУ.ПутьКДанным = ПутьКДанным;
		
		ЭУ.Вид            = ВидПоляФормы.ПолеВвода;
		ЭУ.Видимость      = Истина;
		ЭУ.ТолькоПросмотр = Истина;
		ЭУ.ЦветФона       = WebЦвета.Перламутровый;
		ЭУ.Ширина         = 10;
		ЭУ.ШрифтЗаголовка = Новый Шрифт("MS Shell Dlg", 8, Истина);
		
	КонецЦикла;
	
	НазначитьОформление();
	
	Элементы.ДанныеДерева.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
КонецПроцедуры

&НаСервере
// Процедура создания условного оформления колонкам созданым автоматически.
//
Процедура НазначитьОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона"      , WebЦвета.Перламутровый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУсловия  = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДанныеДерева.ЭтоГруппа");
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	Для каждого ИмяПоля Из мКолонкиДерева Цикл
		
		ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля.Ключ);
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура выполняет заполнение колонок в табличном поле ДанныеДерева.
//
&НаСервере
Процедура ЗаполнитьДерево()
	
	СтруктураНастроек = Документы.бит_СметаДоходовИРасходов.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Кодификатор");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Наименование");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Ссылка");
	
	СтруктураНастроек.ШаблонСметы = ?(ЗначениеЗаполнено(Объект.ШаблонСметы), Объект.ШаблонСметы, Неопределено);
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "СтатьиОборотов";
	
	СтруктураРезультата = Документы.бит_СметаДоходовИРасходов.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	
	Результат = СтруктураРезультата.РезультатЗапроса;
	
	КореньДерева = ДанныеДерева.ПолучитьЭлементы();
	
	КореньДерева.Очистить();
	
	Объект.БДДС.Очистить();
	
	ДобавитьГруппировкуВДерево(Результат, КореньДерева, ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
КонецПроцедуры

&НаСервере
// Выводит группировку в дерево значений
// Параметры:
// ВыборкаВерхняя - РезультатЗапроса или ВыборкаИзРезультатаЗапроса,
// СтрокиДерева   - Коллекция строк дерева значений.
//
Процедура ДобавитьГруппировкуВДерево(ВыборкаВерхняя, СтрокаДерева, СпособОбхода)
	
	Выборка = ВыборкаВерхняя.Выбрать(СпособОбхода);
	
	Пока Выборка.Следующий() Цикл
		
		// Если в группе нет элементов, то не выводим её.
		Добавлять = Истина;
		
		Если Выборка.Ссылка.ЭтоГруппа  Тогда
			
			Добавлять = Ложь;
			ПроверитьНаличиеПодчиненныхЭлементов(Выборка,Добавлять);
			
		КонецЕсли;
		
		Если Добавлять Тогда
			
			ВыборкаНижняя = Выборка.Выбрать(СпособОбхода);
			ЭтоГруппа = ?(Выборка.Ссылка.ЭтоГруппа ИЛИ ВыборкаНижняя.Количество()>0,Истина,Ложь);
			
			ТекСтрока = СтрокаДерева.Добавить();
			ТекСтрока.СтатьяОборотов = Выборка.Ссылка;
			ТекСтрока.ЭтоГруппа      = ЭтоГруппа;
			ТекСтрока.Кодификатор    = Выборка.Кодификатор;
			ТекСтрока.Идентификатор  = Новый УникальныйИдентификатор;
			
			ТекСтрока = ТекСтрока.ПолучитьЭлементы();
			
		КонецЕсли;
		
		ДобавитьГруппировкуВДерево(Выборка, ТекСтрока, СпособОбхода);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
// Процедура проверяет наличие подчиненных элементов. Рекурсивный вызов.
//
// Параметры:
//  ВыборкаВерхняя  – ВыборкаИзРезультатаЗапроса,
//  ЕстьЭлементы    - Булево.
//
Процедура ПроверитьНаличиеПодчиненныхЭлементов(ВыборкаВерхняя,ЕстьЭлементы)
	
	Выборка = ВыборкаВерхняя.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.Ссылка.ЭтоГруппа Тогда
			
			ЕстьЭлементы = Истина;
			Возврат;
			
		КонецЕсли; 
		ПроверитьНаличиеПодчиненныхЭлементов(Выборка,ЕстьЭлементы);
		Если ЕстьЭлементы Тогда
			
			Возврат;
			
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

// Процедура выполняет удаление реквизитов и элементов формы созданых программно.
//
&НаСервере
Процедура УдалитьКолонки()
	
	Если мКолонкиДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеРеквизиты = Новый Массив;
	
	МассивРеквизитов = ПолучитьРеквизиты("ДанныеДерева");
	
	Для каждого Реквизит Из МассивРеквизитов Цикл
		
		Колонка = мКолонкиДерева.Свойство(Реквизит.Имя);
		
		Если Колонка Тогда
			
			УдаляемыеРеквизиты.Добавить(Реквизит.Путь + "." +Реквизит.Имя);
			
			УдаляемыЭлемент = Элементы.Найти(Реквизит.Имя);
			
			Если НЕ УдаляемыЭлемент = Неопределено Тогда
				
				Элементы.Удалить(УдаляемыЭлемент);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	УдаляемыЭлемент = Элементы.Найти("Итого");
	
	Если НЕ УдаляемыЭлемент = Неопределено Тогда
		
		Элементы.Удалить(УдаляемыЭлемент);
		
	КонецЕсли;
	
	УдаляемыеРеквизиты.Добавить("ДанныеДерева.Итого");
	
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
КонецПроцедуры

// Процедура выполняет обновлени данных таблиц формы.
//
&НаСервере
Процедура ОбновитьДерво()
	
	КореньДерева = ДанныеДерева.ПолучитьЭлементы();
	
	КореньДерева.Очистить();
	
	Объект.БДДС.Очистить();
	
	ИнициализироватьКолонки(Истина);
	
	ЗаполнитьДерево();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентыСписокЗданий()
	
	тмпСписокЗданий = Объект.СписокЗданий.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЗданий"       , тмпСписокЗданий);
	Запрос.УстановитьПараметр("СпособРаспределения", Объект.СпособРаспределения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗданий.Здание,
	|	СписокЗданий.ЗданиеПредставление,
	|	СписокЗданий.Адрес,
	|	СписокЗданий.Процент
	|ПОМЕСТИТЬ Здания
	|ИЗ
	|	&СписокЗданий КАК СписокЗданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.Значение,
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ПОМЕСТИТЬ ХаррактеристеткиЗданий
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = &СпособРаспределения
	|	И бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				таб.Здание
	|			ИЗ
	|				Здания КАК таб)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Здания.Здание,
	|	Здания.ЗданиеПредставление,
	|	Здания.Адрес,
	|	Здания.Процент,
	|	ЕстьNull(ХаррактеристеткиЗданий.Значение,0) КАК Значение
	|ИЗ
	|	Здания КАК Здания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХаррактеристеткиЗданий КАК ХаррактеристеткиЗданий
	|		ПО Здания.Здание = ХаррактеристеткиЗданий.ОбъектУчета";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПроцентИтог = Таблица.Итог("Значение");
	
	Если ПроцентИтог <= 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
		
		СтрокаТаблицы.Процент = Окр( СтрокаТаблицы.Значение * 100 / ПроцентИтог, 2);
		
	КонецЦикла;
	
	Объект.СписокЗданий.Очистить();
	Объект.СписокЗданий.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентБДДС(СуммаРаспределения)
	
	ФиксированаяСтруктура = Элементы.БДДС.ОтборСтрок;
	
	Отбор = Новый Структура;
	Для каждого КлючЗначение Из ФиксированаяСтруктура Цикл
		
		Отбор.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		
	КонецЦикла; 
	
	СтрокиПосика = Объект.БДДС.НайтиСтроки(Отбор);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Здание" , Новый ОписаниеТипов("СправочникСсылка.бит_списокЗданий"));
	Таблица.Колонки.Добавить("Процент", ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
	Таблица.Колонки.Добавить("Сумма"  , ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Для каждого СтрокаТаблицы Из СтрокиПосика Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЗданий"       , Таблица);
	Запрос.УстановитьПараметр("СпособРаспределения", СпособРаспределения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокЗданий.Здание,
	|	СписокЗданий.Сумма,
	|	СписокЗданий.Процент
	|ПОМЕСТИТЬ Здания
	|ИЗ
	|	&СписокЗданий КАК СписокЗданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ЗначениеСвойствОбъектовУчета.Значение,
	|	бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета
	|ПОМЕСТИТЬ ХаррактеристеткиЗданий
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|ГДЕ
	|	бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = &СпособРаспределения
	|	И бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				таб.Здание
	|			ИЗ
	|				Здания КАК таб)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Здания.Здание,
	|	Здания.Сумма,
	|	Здания.Процент,
	|	ЕстьNull(ХаррактеристеткиЗданий.Значение,0) КАК Значение
	|ИЗ
	|	Здания КАК Здания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХаррактеристеткиЗданий КАК ХаррактеристеткиЗданий
	|		ПО Здания.Здание = ХаррактеристеткиЗданий.ОбъектУчета";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	ПроцентИтог = Таблица.Итог("Значение");
	
	Для каждого СтрокаТаблицы Из СтрокиПосика Цикл
		
		Процент = 0;
		
		СтрокаПроцент = Таблица.Найти(СтрокаТаблицы.Здание, "Здание");
		
		Если не СтрокаПроцент = Неопределено Тогда
			
			Если ПроцентИтог > 0 Тогда
				Процент = Окр(СтрокаПроцент.Значение * 100 / ПроцентИтог, 2);
			КонецЕсли;
			
			СтрокаТаблицы.Процент = Процент;
			
			СтрокаТаблицы.Сумма = Окр((СуммаРаспределения * Процент)/100, 2);
			
			СтрокаТаблицы.СпособРаспределения = СпособРаспределения;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОбходом(Дерево, Строкародитель = Неопределено)
	
	Если Строкародитель = Неопределено Тогда
		ДеревоДляЗаполнения = ДанныеДерева.ПолучитьЭлементы();
	Иначе
		ДеревоДляЗаполнения = Строкародитель.ПолучитьЭлементы();
	КонецЕсли; 
	
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		
		НоваяСтрока = ДеревоДляЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
		
		ЗаполнитьДеревоОбходом(СтрокаДерева, НоваяСтрока);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийПослеУдаления(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СпособРаспределения) Тогда
		
		ЗаполнитьПроцентыСписокЗданий();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийПодборЗданий(Команда)
	
	ОткрытьФормуПодбораЗданий(Элементы.СписокЗданий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораЗданий(Владелец)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		Для каждого Здание Из ВыбранноеЗначение Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Здание", Здание);
			
			МассивСтрок = Объект.СписокЗданий.НайтиСтроки(Отбор);
			
			Если МассивСтрок.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.СписокЗданий.Добавить();
				
				ПочтовыйАдрес = ПочтовыйАдресНаСервере(Здание);
				Улица = УлицаНаСервере(Здание);
				
				НоваяСтрока.Адрес               = ПочтовыйАдрес;
				НоваяСтрока.Здание              = Здание;
				НоваяСтрока.ЗданиеПредставление = "ул." + Улица + " ,д" + Здание;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Объект.СпособРаспределения) Тогда
			ЗаполнитьПроцентыСписокЗданий();
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСПодборЗданий(Команда)
	
	ОткрытьФормуПодбораЗданий(Элементы.БДДС);
	
КонецПроцедуры

&НаКлиенте
Процедура БДДСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		
		Для каждого Здание Из ВыбранноеЗначение Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("СтатьяОборотов", Элементы.БДДС.ОтборСтрок.СтатьяОборотов);
			Отбор.Вставить("Период"        , Элементы.БДДС.ОтборСтрок.Период);
			Отбор.Вставить("ИД"            , Элементы.БДДС.ОтборСтрок.ИД);
			Отбор.Вставить("Здание"        , Здание);
			
			МассивСтрок = Объект.БДДС.НайтиСтроки(Отбор);
			
			Если МассивСтрок.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.БДДС.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
				
				НоваяСтрока.Адрес               = Здание.ПочтовыйАдрес;
				НоваяСтрока.ЗданиеПредставление = "ул." + Здание.Улица + " ,д" + Здание;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		ТекущиеДанныеДрева   = Элементы.ДанныеДерева.ТекущиеДанные;
		ТекущаяЭлементДерева = Элементы.ДанныеДерева.ТекущийЭлемент;
		
		Если ТекущаяЭлементДерева = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанныеДрева = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяКолонки = ТекущаяЭлементДерева.Имя;
		
		Если Найти(ИмяКолонки,"РеквизитДерева_") > 0 Тогда
			СуммаРаспределения = ТекущиеДанныеДрева[ИмяКолонки];
			ЗаполнитьПроцентБДДС(СуммаРаспределения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланированияПриИзменении(Элемент)
	
	Если ДанныеДерева.ПолучитьЭлементы().Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДатаНачалаПланированияПриИзмененииЗавершение", ЭтотОбъект), "Данные будут очищенны, продолжить?", РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланированияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьДерво();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПланированияПриИзменении(Элемент)
	
	Если ДанныеДерева.ПолучитьЭлементы().Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДатаОкончанияПланированияПриИзмененииЗавершение", ЭтотОбъект), "Данные будут очищенны, продолжить?", РежимДиалогаВопрос.ДаНет,5,КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПланированияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса; 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьДерво();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
